In [2]:
import mysql.connector as connector
from mysql.connector import Error
import pandas as pd

In [3]:
# Step 1: Establish a connection and create a cursor:

try:
    connection = connector.connect(
        user = 'root',
        password = '******'
    )
    print('Connection established...')

    cursor = connection.cursor(buffered=True)
    print('Cursor created...')

except Error as err:

    print('Error code: ', err.errno)
    print('Error message: ',err.msg)

Connection established...
Cursor created...

In [4]:
# Step 2: Create the database and set it for use:

cursor.execute("""DROP DATABASE IF EXISTS meta_pyToMySQL_test;""")

cursor.execute("""CREATE DATABASE meta_pyToMySQL_test;""")

cursor.execute("""USE meta_pyToMySQL_test;""")

print('Database in use: ', connection.database)

Database in use:  meta_pytomysql_test

In [5]:
# Step 3: Create tables:

create_menuitem_table = """CREATE TABLE menu_items (
itemID INT AUTO_INCREMENT,
name VARCHAR(200),
type VARCHAR(100),
price INT,
PRIMARY KEY (ItemID)
);"""

create_menu_table = """CREATE TABLE menus (
menuID INT,
itemID INT,
cuisine VARCHAR(100),
PRIMARY KEY (MenuID,ItemID)
);"""

create_booking_table = """CREATE TABLE bookings (
bookingID INT AUTO_INCREMENT,
tableNo INT,
guestFirstName VARCHAR(100) NOT NULL,
guestLastName VARCHAR(100) NOT NULL,
bookingSlot TIME NOT NULL,
employeeID INT,
PRIMARY KEY (BookingID)
);"""

create_orders_table = """CREATE TABLE orders (
orderID INT,
tableNo INT,
menuID INT,
bookingID INT,
billAmount INT,
quantity INT,
PRIMARY KEY (OrderID,TableNo)
);"""

create_employees_table = """
CREATE TABLE employees (
employeeID INT AUTO_INCREMENT PRIMARY KEY,
name VARCHAR(200),
role VARCHAR(100),
address VARCHAR(200),
contact_number INT,
email VARCHAR (100),
annual_salary INT
);"""

# Create MenuItems table
cursor.execute("DROP TABLE IF EXISTS menu_items ")
cursor.execute(create_menuitem_table)

# Create Menu table
cursor.execute("DROP TABLE IF EXISTS menus ")
cursor.execute(create_menu_table)

# Create Bookings table
cursor.execute("DROP TABLE IF EXISTS bookings ")
cursor.execute(create_booking_table)

# Create Orders table
cursor.execute("DROP TABLE IF EXISTS orders ")
cursor.execute(create_orders_table)

# Create Employees table
cursor.execute("DROP TABLE IF EXISTS employees ")
cursor.execute(create_employees_table)

In [6]:

#*******************************************************#
# Insert query to populate "menu_items" table:
#*******************************************************#
insert_menu_items="""
INSERT INTO menu_items (itemID, name, type, price)
VALUES
(1, 'Olives','Starters',5),
(2, 'Flatbread','Starters', 5),
(3, 'Minestrone', 'Starters', 8),
(4, 'Tomato bread','Starters', 8),
(5, 'Falafel', 'Starters', 7),
(6, 'Hummus', 'Starters', 5),
(7, 'Greek salad', 'Main Courses', 15),
(8, 'Bean soup', 'Main Courses', 12),
(9, 'Pizza', 'Main Courses', 15),
(10, 'Greek yoghurt','Desserts', 7),
(11, 'Ice cream', 'Desserts', 6),
(12, 'Cheesecake', 'Desserts', 4),
(13, 'Athens White wine', 'Drinks', 25),
(14, 'Corfu Red Wine', 'Drinks', 30),
(15, 'Turkish Coffee', 'Drinks', 10),
(16, 'Turkish Coffee', 'Drinks', 10),
(17, 'Kabasa', 'Main Courses', 17);"""

#*******************************************************#
# Insert query to populate "menu" table:
#*******************************************************#
insert_menu="""
INSERT INTO menus (menuID,itemID,cuisine)
VALUES
(1, 1, 'Greek'),
(1, 7, 'Greek'),
(1, 10, 'Greek'),
(1, 13, 'Greek'),
(2, 3, 'Italian'),
(2, 9, 'Italian'),
(2, 12, 'Italian'),
(2, 15, 'Italian'),
(3, 5, 'Turkish'),
(3, 17, 'Turkish'),
(3, 11, 'Turkish'),
(3, 16, 'Turkish');"""

#*******************************************************#
# Insert query to populate "bookings" table:
#*******************************************************#
insert_bookings="""
INSERT INTO bookings (bookingID, tableNo, guestFirstName, 
guestLastName, bookingSlot, employeeID)
VALUES
(1, 12, 'Anna','Iversen','19:00:00',1),
(2, 12, 'Joakim', 'Iversen', '19:00:00', 1),
(3, 19, 'Vanessa', 'McCarthy', '15:00:00', 3),
(4, 15, 'Marcos', 'Romero', '17:30:00', 4),
(5, 5, 'Hiroki', 'Yamane', '18:30:00', 2),
(6, 8, 'Diana', 'Pinto', '20:00:00', 5);"""

#*******************************************************#
# Insert query to populate "orders" table:
#*******************************************************#
insert_orders="""
INSERT INTO orders (orderID, tableNo, menuID, bookingID, quantity, billAmount)
VALUES
(1, 12, 1, 1, 2, 86),
(2, 19, 2, 2, 1, 37),
(3, 15, 2, 3, 1, 37),
(4, 5, 3, 4, 1, 40),
(5, 8, 1, 5, 1, 43);"""

#*******************************************************#
# Insert query to populate "employees" table:
#*******************************************************#
insert_employees = """
INSERT INTO employees (employeeID,name, role, address, contact_number, email, annual_salary)
VALUES
(01,'Mario Gollini','Manager','724, Parsley Lane, Old Town, Chicago, IL',351258074,'Mario.g@littlelemon.com',70.000),
(02,'Adrian Gollini','Assistant Manager','334, Dill Square, Lincoln Park, Chicago, IL',351474048,'Adrian.g@littlelemon.com',65.000),
(03,'Giorgos Dioudis','Head Chef','879 Sage Street, West Loop, Chicago, IL',351970582,'Giorgos.d@littlelemon.com',50.000),
(04,'Fatma Kaya','Assistant Chef','132  Bay Lane, Chicago, IL',351963569,'Fatma.k@littlelemon.com',45.000),
(05,'Elena Salvai','Head Waiter','989 Thyme Square, EdgeWater, Chicago, IL',351074198,'Elena.s@littlelemon.com',40.000),
(06,'John Millar','Receptionist','245 Dill Square, Lincoln Park, Chicago, IL',351584508,'John.m@littlelemon.com',35.000);"""

# Populate menu_items table
cursor.execute(insert_menu_items)
connection.commit()

# Populate MenuItems table
cursor.execute(insert_menu)
connection.commit()

# Populate Bookings table
cursor.execute(insert_bookings)
connection.commit()

# Populate Orders table
cursor.execute(insert_orders)
connection.commit()

# Populate Employees table
cursor.execute(insert_employees)
connection.commit()

In [7]:
# close connction:

if connection.is_connected():
    cursor.close()
    connection.close()
    print('Connection closed')
else:
    print('Connection do not exists')

Connection closed